test/setup_pimple/system/controlDict
// SPDX-License-Identifier: Unlicense
// SPDX-FileCopyrightText: 2023 NeoFOAM authors
// Generated file — edit neofoam_generate_controlDict in CMakeLists.txt.
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     neoPimpleFoam;
executor        Serial;
allocator       default;
startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2;

deltaT          0.005;

writeControl    timeStep;

writeInterval   400;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
