test/setup_pimple/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver PCG;
        preconditioner diagonal;
        tolerance 1e-13;
        relTol 1e-13;
        maxIter 5000;
        l1ScaledResidual true;
    }
    pFinal
    {
        solver PCG;
        preconditioner diagonal;
        tolerance 1e-13;
        relTol 1e-13;
        maxIter 5000;
        l1ScaledResidual true;
    }
    U
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-13;
        relTol 1e-13;
        maxIter 1000;
        l1ScaledResidual true;
    }
    UFinal
    {
        solver PBiCGStab;
        preconditioner DILU;
        tolerance 1e-13;
        relTol 1e-13;
        maxIter 1000;
        l1ScaledResidual true;
    }
}

relaxationFactors
{
    equations
    {
        U       0.7;
        UFinal  1;
    }
    fields
    {
        p       0.3;
        pFinal  1;
    }
}

PIMPLE
{
    nOuterCorrectors 3;
    nCorrectors 2;
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p { tolerance 1e-6; relTol 0; }
        U { tolerance 1e-6; relTol 0; }
    }
    pRefCell 0;
    pRefValue 0;
}

//*************************************************************************//
